---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.IsPanelSinglePhase
source: html/57c53807-579e-d23c-2e3c-bb08b5ca9440.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.IsPanelSinglePhase Property

Identifies if the panel is single phase.

## Syntax (C#)
```csharp
public bool IsPanelSinglePhase { get; set; }
```

## Remarks
If true, the panel is single phase. If false, the panel is 3-phase.